Tekla.Structures.AnalysisInternal.DotAnalysisModelIssue
DO NOT USE! For internal usage only!

Tekla.Structures.AnalysisInternal.DotAnalysisModelIssue.AnalysisModelName
The name of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisModelIssue.Index
The 0-based index, or -1 to initialize fetch (input to core)

Tekla.Structures.AnalysisInternal.DotAnalysisModelIssue.Count
The count of issues (output from core)

Tekla.Structures.AnalysisInternal.DotAnalysisModelIssue.Severity
The severity.

Tekla.Structures.AnalysisInternal.DotAnalysisModelIssue.Type
The type.

Tekla.Structures.AnalysisInternal.DotAnalysisModelIssue.Description
The description.

Tekla.Structures.AnalysisInternal.DotAnalysisModelIssue.Details
The details (with line breaks).

Tekla.Structures.AnalysisInternal.DotAnalysisModelIssue.AnalysisObjectCount
Analysis object count.

Tekla.Structures.AnalysisInternal.DotAnalysisModelIssue.AnalysisObjects
The list of analysis objects.

Tekla.Structures.AnalysisInternal.DotAnalysisModelIssue.ModelObjectCount
Analysis object count.

Tekla.Structures.AnalysisInternal.DotAnalysisModelIssue.ModelObjectIds
The list of model object IDs.

Tekla.Structures.AnalysisInternal.DotAnalysisModelIssue.PositionCount
Position count.

Tekla.Structures.AnalysisInternal.DotAnalysisModelIssue.Positions
The list of positions.